#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.google_project.project: Reading...
google_cloud_run_service_iam_member.run_all_users: Refreshing state... [id=v1/projects/poc-test-397814/locations/us-central1/services/jmusic/roles/run.invoker/allUsers]
data.google_client_config.current: Reading...
google_project_service.run_api: Refreshing state... [id=poc-test-397814/run.googleapis.com]
google_cloud_run_service.run_service: Refreshing state... [id=locations/us-central1/namespaces/poc-test-397814/services/jmusic]
data.google_client_config.current: Read complete after 0s [id=projects/"poc-test-397814"/regions/"us-central1"/zones/"us-central1-c"]
data.google_project.project: Read complete after 0s [id=projects/poc-test-397814]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # google_cloud_run_service.run_service will be destroyed
  # (because google_cloud_run_service.run_service is not in configuration)
  - resource "google_cloud_run_service" "run_service" {
      - autogenerate_revision_name = false -> null
      - id                         = "locations/us-central1/namespaces/poc-test-397814/services/jmusic" -> null
      - location                   = "us-central1" -> null
      - name                       = "jmusic" -> null
      - project                    = "poc-test-397814" -> null
      - status                     = [
          - {
              - conditions                   = [
                  - {
                      - message = ""
                      - reason  = ""
                      - status  = "True"
                      - type    = "Ready"
                    },
                  - {
                      - message = ""
                      - reason  = ""
                      - status  = "True"
                      - type    = "ConfigurationsReady"
                    },
                  - {
                      - message = ""
                      - reason  = ""
                      - status  = "True"
                      - type    = "RoutesReady"
                    },
                ]
              - latest_created_revision_name = "jmusic-00001-ssr"
              - latest_ready_revision_name   = "jmusic-00001-ssr"
              - observed_generation          = 1
              - traffic                      = [
                  - {
                      - latest_revision = true
                      - percent         = 100
                      - revision_name   = "jmusic-00001-ssr"
                      - tag             = ""
                      - url             = ""
                    },
                ]
              - url                          = "https://jmusic-ogoetwvqcq-uc.a.run.app"
            },
        ] -> null

      - metadata {
          - annotations      = {
              - "run.googleapis.com/ingress"        = "all"
              - "run.googleapis.com/ingress-status" = "all"
              - "run.googleapis.com/operation-id"   = "a3c133c9-89ed-4e07-8778-e6daf9b914f8"
              - "serving.knative.dev/creator"       = "poc-test-dev@poc-test-397814.iam.gserviceaccount.com"
              - "serving.knative.dev/lastModifier"  = "poc-test-dev@poc-test-397814.iam.gserviceaccount.com"
            } -> null
          - generation       = 1 -> null
          - labels           = {
              - "cloud.googleapis.com/location" = "us-central1"
            } -> null
          - namespace        = "poc-test-397814" -> null
          - resource_version = "AAYEa2X/V0g" -> null
          - self_link        = "/apis/serving.knative.dev/v1/namespaces/746606943466/services/jmusic" -> null
          - uid              = "cd54b167-e401-4166-a869-456868b2c9d8" -> null
        }

      - template {
          - metadata {
              - annotations = {
                  - "autoscaling.knative.dev/maxScale" = "100"
                } -> null
              - generation  = 0 -> null
              - labels      = {
                  - "run.googleapis.com/startupProbeType" = "Default"
                } -> null
            }
          - spec {
              - container_concurrency = 80 -> null
              - service_account_name  = "746606943466-compute@developer.gserviceaccount.com" -> null
              - timeout_seconds       = 300 -> null

              - containers {
                  - args    = [] -> null
                  - command = [] -> null
                  - image   = "gcr.io/google-samples/hello-app:1.0" -> null

                  - ports {
                      - container_port = 8080 -> null
                      - name           = "http1" -> null
                    }

                  - resources {
                      - limits   = {
                          - "cpu"    = "1000m"
                          - "memory" = "512Mi"
                        } -> null
                      - requests = {} -> null
                    }

                  - startup_probe {
                      - failure_threshold     = 1 -> null
                      - initial_delay_seconds = 0 -> null
                      - period_seconds        = 240 -> null
                      - timeout_seconds       = 240 -> null

                      - tcp_socket {
                          - port = 8080 -> null
                        }
                    }
                }
            }
        }

      - traffic {
          - latest_revision = true -> null
          - percent         = 100 -> null
        }
    }

  # google_cloud_run_service_iam_member.run_all_users will be destroyed
  # (because google_cloud_run_service_iam_member.run_all_users is not in configuration)
  - resource "google_cloud_run_service_iam_member" "run_all_users" {
      - etag     = "BwYEa3oGr/o=" -> null
      - id       = "v1/projects/poc-test-397814/locations/us-central1/services/jmusic/roles/run.invoker/allUsers" -> null
      - location = "us-central1" -> null
      - member   = "allUsers" -> null
      - project  = "poc-test-397814" -> null
      - role     = "roles/run.invoker" -> null
      - service  = "v1/projects/poc-test-397814/locations/us-central1/services/jmusic" -> null
    }

  # google_cloud_run_v2_service.run_service will be created
  + resource "google_cloud_run_v2_service" "run_service" {
      + conditions              = (known after apply)
      + create_time             = (known after apply)
      + creator                 = (known after apply)
      + delete_time             = (known after apply)
      + etag                    = (known after apply)
      + expire_time             = (known after apply)
      + generation              = (known after apply)
      + id                      = (known after apply)
      + ingress                 = "INGRESS_TRAFFIC_ALL"
      + last_modifier           = (known after apply)
      + latest_created_revision = (known after apply)
      + latest_ready_revision   = (known after apply)
      + launch_stage            = (known after apply)
      + location                = "us-central1"
      + name                    = "jmusicbot"
      + observed_generation     = (known after apply)
      + project                 = (known after apply)
      + reconciling             = (known after apply)
      + terminal_condition      = (known after apply)
      + traffic_statuses        = (known after apply)
      + uid                     = (known after apply)
      + update_time             = (known after apply)
      + uri                     = (known after apply)

      + template {
          + max_instance_request_concurrency = (known after apply)
          + service_account                  = (known after apply)
          + timeout                          = (known after apply)

          + containers {
              + image = "craumix/jmusicbot"

              + volume_mounts {
                  + mount_path = "/jmb/config"
                  + name       = "a-volume"
                }
            }

          + volumes {
              + name = "a-volume"

              + secret {
                  + default_mode = 400
                  + secret       = "jmusic-config"

                  + items {
                      + mode    = 400
                      + path    = "config.txt"
                      + version = "1"
                    }
                }
            }
        }
    }

  # google_cloud_run_v2_service_iam_member.run_all_users will be created
  + resource "google_cloud_run_v2_service_iam_member" "run_all_users" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + location = "us-central1"
      + member   = "allUsers"
      + name     = "jmusicbot"
      + project  = (known after apply)
      + role     = "roles/run.invoker"
    }

  # google_secret_manager_secret.secret will be created
  + resource "google_secret_manager_secret" "secret" {
      + create_time = (known after apply)
      + expire_time = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + project     = (known after apply)
      + secret_id   = "jmusic-config"

      + replication {
          + automatic = true
        }
    }

  # google_secret_manager_secret_iam_member.secret-access will be created
  + resource "google_secret_manager_secret_iam_member" "secret-access" {
      + etag      = (known after apply)
      + id        = (known after apply)
      + member    = "serviceAccount:746606943466-compute@developer.gserviceaccount.com"
      + project   = (known after apply)
      + role      = "roles/secretmanager.secretAccessor"
      + secret_id = (known after apply)
    }

  # google_secret_manager_secret_version.secret-version-data will be created
  + resource "google_secret_manager_secret_version" "secret-version-data" {
      + create_time  = (known after apply)
      + destroy_time = (known after apply)
      + enabled      = true
      + id           = (known after apply)
      + name         = (known after apply)
      + secret       = (known after apply)
      + secret_data  = (sensitive value)
      + version      = (known after apply)
    }

Plan: 5 to add, 0 to change, 2 to destroy.

Changes to Outputs:
  + service_url = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @benpngo, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform Demo Plan`*